БухЭксп/Catalogs/CW_ВебШаблоныЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВебШаблоныЗаявок</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеRU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеEN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенВыводНаАнглийскомЯзыке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеМакета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМакетаНовойЗаявки</Name>
					<Comment>0 - стандартный; 1 - индивидуальный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноПрикреплятьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокНовойЗаявкиRU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокНовойЗаявкиEN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставЗаявки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокПоляRU</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокПоляEN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодсказкаПоляRU</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодсказкаПоляEN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрЗаявки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХраниилщеОтбора</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОграничиватьДоступныеЗначеия</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеСсылка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяОбластиМакета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбязательноДляЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеТипаЗначения</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыФайлов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяГруппыRU</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяГруппыEN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеШрифт</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеЦветФона</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеЦветТекста</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьОформление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображатьЗаголовок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВебШаблоныЗаявок/Ext/ManagerModule.bsl
Процедура ПоместитьСхемуКомпановкиДанныхДляТипаПоАдресу(Тип, АдресРезультата) Экспорт
	
	МетаданныеПоТипу 	= Метаданные.НайтиПоТипу(Тип);
	ПолноеИмя 			= МетаданныеПоТипу.ПолноеИмя(); 
	
	мТипы = Новый Массив;
	мТипы.Добавить(Тип);
	ОписаниеТипов = Новый ОписаниеТипов(мТипы);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ОбъектБазыДанных.Ссылка КАК Ссылка
	|ИЗ
	|	"+ПолноеИмя+" КАК ОбъектБазыДанных";
	
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанных1";
	НаборДанных.Запрос = ТекстЗапроса;
	НаборДанных.ИсточникДанных = "ИсточникДанных1";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина; 
	
	ДобавленноеПоле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	ДобавленноеПоле.Заголовок = СокрЛП(МетаданныеПоТипу.Синоним);
	ДобавленноеПоле.ПутьКДанным = "Ссылка";
	ДобавленноеПоле.Поле = "Ссылка";
	ДобавленноеПоле.ТипЗначения = ОписаниеТипов;
	
	ВыбранноеПоле = СхемаКомпоновкиДанных.ВариантыНастроек[0].Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Ссылка");	
	
	ПолеПорядка = СхемаКомпоновкиДанных.ВариантыНастроек[0].Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ПолеПорядка.Использование = Истина;                       
	ПолеПорядка.Поле = Новый ПолеКомпоновкиДанных("Ссылка"); 
	
	Структура = СхемаКомпоновкиДанных.ВариантыНастроек[0].Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Структура.Использование = Истина;
	Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	
	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресРезультата);
	
КонецПроцедуры

Функция ПолучитьМассивЭлементовПоТипуЗначения(ТипЗначения, НастройкиКомпановщика=Неопределено) Экспорт 
	
	АдресСхемы = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	ПоместитьСхемуКомпановкиДанныхДляТипаПоАдресу(ТипЗначения, АдресСхемы);
	
	СКД 		= ПолучитьИзВременногоХранилища(АдресСхемы); 
	Настройки 	= СКД.НастройкиПоУмолчанию;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;  
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);   
	
	Если НастройкиКомпановщика <> Неопределено Тогда
		_УФС.СкопироватьОтбор(НастройкиКомпановщика.Отбор, КомпоновщикНастроек.Настройки.Отбор);	
	КонецЕсли;
	
	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;    
	МакетКомпоновки 	= КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ТаблицаЗначений = Новый ТаблицаЗначений;    
	
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;    
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВыводаРезультата 	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;    
	ПроцессорВыводаРезультата.УстановитьОбъект(ТаблицаЗначений); 
	ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновкиДанных);

	УдалитьИзВременногоХранилища(АдресСхемы);    
	
	Возврат ТаблицаЗначений.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьСтруктуруШаблонаЗаявки(Знач ШаблонЗаявки, Знач Язык, Знач КопируемаяЗаявка = Неопределено) Экспорт
	
	ПоляМакета = Новый Массив;  
	ДоступныеЗначения = Новый Соответствие;  
	
	ПолучатьПеревод = (Язык <> ПредопределенноеЗначение("Справочник.CW_Языки.ru"));
	Если Не ШаблонЗаявки.ДоступенВыводНаАнглийскомЯзыке Тогда
		//Устанвилваем язык "ru" независимо от того, что установлено для пользователя.
		Язык = ПредопределенноеЗначение("Справочник.CW_Языки.ru");
		ПолучатьПеревод = Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаГруппы из ШаблонЗаявки.ГруппыПараметров Цикл  
		
		ПоляГруппы = новый Массив;
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторГруппы", СтрокаГруппы.ИдентификаторГруппы);
		
		МассивСтрок = ШаблонЗаявки.СоставЗаявки.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаСтруктуры из МассивСтрок Цикл  
			
			Если ШаблонЗаявки.ТипМакетаНовойЗаявки =  0 Тогда
				ЗаголовокПоля = Нстр("ru='"+СтрокаСтруктуры.ЗаголовокПоляRU+"'; en='"+СтрокаСтруктуры.ЗаголовокПоляEN+"'", СокрЛП(Язык));
				ПодсказкаПоля = Нстр("ru='"+СтрокаСтруктуры.ПодсказкаПоляRU+"'; en='"+СтрокаСтруктуры.ПодсказкаПоляEN+"'", СокрЛП(Язык));
			КонецЕсли;  
			
			ЗначениеПоУмолчанию = СтрокаСтруктуры.ЗначениеПоУмолчанию.Получить();   
			СтрокаЗначениеПоУмолчанию = СокрЛП(ЗначениеПоУмолчанию);
			ОписаниеТипаВсеСсылки = ОбщегоНазначения.ОписаниеТипаВсеСсылки();
			ЭтоСсылка = ОписаниеТипаВсеСсылки.СодержитТип(ТипЗнч(ЗначениеПоУмолчанию)); 
			Если ЭтоСсылка И ПолучатьПеревод Тогда
				//Пробуем получить перевод
				СтрокаЗначениеПоУмолчанию = CW_ПереводыСервер.ПолучитьПеревод(ЗначениеПоУмолчанию,, Язык);
			КонецЕсли;                                    
			
			default = Новый Структура;
			default.Вставить("id",   XMLСтрока("")); 
			default.Вставить("name", XMLСтрока("")); 
			
			Если КопируемаяЗаявка = Неопределено Тогда 
				Если ЗначениеЗаполнено(ЗначениеПоУмолчанию) Тогда
					default = Новый Структура;
					default.Вставить("id",   XMLСтрока(ЗначениеПоУмолчанию)); 
					default.Вставить("name", XMLСтрока(СтрокаЗначениеПоУмолчанию)); 
				КонецЕсли; 
			Иначе
				
				Если ТипЗнч(СтрокаСтруктуры.ПараметрЗаявки) = Тип("Строка") Тогда
					//Реквизит заявки
					ЗначениеПоУмолчанию 		= КопируемаяЗаявка[СтрокаСтруктуры.ПараметрЗаявки];	 
					СтрокаЗначениеПоУмолчанию 	= Строка(ЗначениеПоУмолчанию);
				Иначе
					//Парамтер заявки
					СтрокаПараметра = КопируемаяЗаявка.ПараметрыЗаявки.Найти(СтрокаСтруктуры.ПараметрЗаявки, "Параметр");
					Если СтрокаПараметра <> Неопределено Тогда
						ЗначениеПоУмолчанию 		= СтрокаПараметра.Значение;
						СтрокаЗначениеПоУмолчанию 	= Строка(ЗначениеПоУмолчанию);
					КонецЕсли;
					
				КонецЕсли;  
				
				default = Новый Структура;
				default.Вставить("id",   XMLСтрока(ЗначениеПоУмолчанию)); 
				default.Вставить("name", XMLСтрока(СтрокаЗначениеПоУмолчанию)); 
				
			КонецЕсли;
		
		
			МассивДоступныеЗначения = Новый Массив; 
			
			Если СтрокаСтруктуры.ПолеСсылка Тогда
				
				ОписаниеТипа	= СтрокаСтруктуры.ХранилищеТипаЗначения.Получить();
				ПустаяСылка		= ОписаниеТипа.ПривестиЗначение(Неопределено);
				
				НастройкиОтбора	= СтрокаСтруктуры.ХраниилщеОтбора.Получить();
				МассивЭлементов	= Справочники.CW_ВебШаблоныЗаявок.ПолучитьМассивЭлементовПоТипуЗначения(ТипЗнч(ПустаяСылка), НастройкиОтбора);
				
				ЕстьВМассивеЗначениеПоУмолчанию = Ложь;
				Для Каждого ЭлементМассива из МассивЭлементов Цикл
					
					Если XMLСтрока(ЭлементМассива) = XMLСтрока(ЗначениеПоУмолчанию) Тогда
						ЕстьВМассивеЗначениеПоУмолчанию = Истина;
					КонецЕсли;
					
					ПредставлениеЗначения =  СокрЛП(ЭлементМассива);
					Если ЭтоСсылка И ПолучатьПеревод Тогда
						//Пробуем получить перевод
						ПредставлениеЗначения = CW_ПереводыСервер.ПолучитьПеревод(ЭлементМассива,, Язык);
					КонецЕсли;                                    
					
					СтруктураЗначения = Новый Структура;
					СтруктураЗначения.Вставить("id",   XMLСтрока(ЭлементМассива)); 
					СтруктураЗначения.Вставить("name", XMLСтрока(ПредставлениеЗначения)); 
					
					МассивДоступныеЗначения.Добавить(СтруктураЗначения);
				КонецЦикла;
				
				Если ЗначениеЗаполнено(ЗначениеПоУмолчанию)
					и МассивДоступныеЗначения.Найти(default) = Неопределено Тогда
					МассивДоступныеЗначения.Добавить(default);
				КонецЕсли;
				
				СтроковоеПредставлениеТипа = "Строка";  
				
				ОписаниеТипа = Новый ОписаниеТипов(СтроковоеПредставлениеТипа,,,,Новый КвалификаторыСтроки(150));
				
			Иначе  
				
				ОписаниеТипа				= СтрокаСтруктуры.ХранилищеТипаЗначения.Получить();
				ПустоеЗначение				= ОписаниеТипа.ПривестиЗначение(Неопределено);
 				СтроковоеПредставлениеТипа 	= ОбщегоНазначения.СтроковоеПредставлениеТипа(ТипЗнч(ПустоеЗначение));	
				
			КонецЕсли; 
			
			ДоступныеЗначения.Вставить(XMLСтрока(СтрокаСтруктуры.ИмяОбластиМакета), МассивДоступныеЗначения);   
			
			ДанныеПоля = Новый Структура;
			ДанныеПоля.Вставить("name",  		XMLСтрока(СтрокаСтруктуры.ИмяОбластиМакета));
			ДанныеПоля.Вставить("titlename",  	XMLСтрока("title_"+СтрокаСтруктуры.ИмяОбластиМакета));
			ДанныеПоля.Вставить("title",  		XMLСтрока(ЗаголовокПоля));
			ДанныеПоля.Вставить("help",  		XMLСтрока(ПодсказкаПоля));
			ДанныеПоля.Вставить("default", 		default);   
			ДанныеПоля.Вставить("required",  	XMLСтрока(СтрокаСтруктуры.ОбязательноДляЗаполнения));
			ДанныеПоля.Вставить("list",  		XMLСтрока(МассивДоступныеЗначения.Количество()>0));
			ДанныеПоля.Вставить("type",  		CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ОписаниеТипа));
			
			ПоляГруппы.Добавить(ДанныеПоля);  
			
		КонецЦикла; 
		
		ЗаголовокГруппыПоля = Нстр("ru='"+СтрокаГруппы.ИмяГруппыRU+"'; en='"+СтрокаГруппы.ИмяГруппыEN+"'", СокрЛП(Язык)); 
		
		Шрифт 		= СтрокаГруппы.ХранилищеШрифт.Получить();
		ЦветФона 	= СтрокаГруппы.ХранилищеЦветФона.Получить();
		ЦветТекста 	= СтрокаГруппы.ХранилищеЦветТекста.Получить();
		
		ДанныеОформления = Новый Структура;
		ДанныеОформления.Вставить("font",               CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(Шрифт));
		ДанныеОформления.Вставить("backgroundcolor",    CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ЦветФона));
		ДанныеОформления.Вставить("textcolor",         	CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ЦветТекста));
		
		ДанныеГруппы = Новый Структура;
		ДанныеГруппы.Вставить("name",		XMLСтрока(ЗаголовокГруппыПоля));
		ДанныеГруппы.Вставить("show",		XMLСтрока(СтрокаГруппы.ОтображатьЗаголовок));  
		ДанныеГруппы.Вставить("decoration",	ДанныеОформления); 		
		ДанныеГруппы.Вставить("fields", 	ПоляГруппы);
		
		ПоляМакета.Добавить(ДанныеГруппы);
		
	КонецЦикла; 
	
	МассивТиповФайлов = Новый Массив;
	
	ЗапрашиватьТипФайла = ПолучитьФункциональнуюОпцию("CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив");
	Если ЗапрашиватьТипФайла Тогда    
		ДоступныеТипыФайлов = ШаблонЗаявки.ТипыФайлов.Выгрузить().ВыгрузитьКолонку("Тип");	
		ЗаполнитьМассивТиповФайлов(ДоступныеТипыФайлов, МассивТиповФайлов, Язык);
	КонецЕсли;    
	
	ЗаголовокЗаявки = Нстр("ru='"+ШаблонЗаявки.ЗаголовокНовойЗаявкиRU+"'; en='"+ШаблонЗаявки.ЗаголовокНовойЗаявкиEN+"'", СокрЛП(Язык));
	
	//Получение данных шаблона 
	СтруктураШаблона = Новый Структура;
	СтруктураШаблона.Вставить("id", 			XMLСтрока(ШаблонЗаявки));
	СтруктураШаблона.Вставить("type",			XMLСтрока(ШаблонЗаявки.ТипМакетаНовойЗаявки));  
	СтруктураШаблона.Вставить("title",          ЗаголовокЗаявки);
	СтруктураШаблона.Вставить("fields",			ПоляМакета);   
	СтруктураШаблона.Вставить("values",			ДоступныеЗначения);   
	СтруктураШаблона.Вставить("attachfiles",	XMLСтрока(ШаблонЗаявки.РазрешеноПрикреплятьФайлы));
	СтруктураШаблона.Вставить("filetype",		МассивТиповФайлов);

	Возврат СтруктураШаблона;

КонецФункции     

Функция ПривестиЗначениеJSON(Знач Знчаение, Знач ОписаниеТипаВсеСсылки, Знач Тип)
	
	Типы = Новый Массив;
	ОписаниеТипов = Новый ОписаниеТипов(Типы);
	ПриведенноеЗначение = ОписаниеТипов.ПривестиЗначение(Неопределено);
	
	Если ЗначениеЗаполнено(Знчаение) Тогда
		Если ОписаниеТипаВсеСсылки.СодержитТип(Тип) Тогда
			Если Не ПустаяСтрока(Знчаение) Тогда
				ПолноеИмя = Метаданные.НайтиПоТипу(Тип).ПолноеИмя();
				Менеджер  = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);   
				ПриведенноеЗначение = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(Знчаение));   
			КонецЕсли;
		Иначе 
			ПриведенноеЗначение = XMLЗначение(Тип, Знчаение);  
		КонецЕсли;  
	КонецЕсли;  
	
	Возврат ПриведенноеЗначение;
	
КонецФункции

Процедура ЗаполнитьМассивТиповФайлов(Знач ДоступныеТипыФайлов, МассивТиповФайлов, Язык) Экспорт
	
	Для Каждого ТипФайла из ДоступныеТипыФайлов Цикл   
		
		Если Язык = ПредопределенноеЗначение("Справочник.CW_Языки.ПустаяСсылка") Тогда
			Язык = ПредопределенноеЗначение("Справочник.CW_Языки.ru");
		КонецЕсли;  
		
		НаименованиеRU = СокрЛП(ТипФайла);
		Если Язык <> ПредопределенноеЗначение("Справочник.CW_Языки.ru") тогда
			НаименованиеEN = CW_ПереводыСервер.ПолучитьПеревод(ТипФайла,, Язык); 
		КонецЕсли;   
		
		НаименованиеТипа =  Нстр("ru='"+НаименованиеRU+"'; en='"+НаименованиеEN+"'");
		
		ДанныеТипаФайла = Новый Структура;
		ДанныеТипаФайла.Вставить("id", 		XMLСтрока(ТипФайла));
		ДанныеТипаФайла.Вставить("name", 	XMLСтрока(НаименованиеТипа));  
		
		МассивТиповФайлов.Добавить(ДанныеТипаФайла);    
		
	КонецЦикла;

КонецПроцедуры


//Шаблоны стандартных писем
Процедура ДополнитьМакросыОбъекта(ДеревоМакросов) Экспорт

	ГруппаМакросов = ДеревоМакросов.Строки.Добавить();  
	ГруппаМакросов.ИндексКартинки 	= 0;
	ГруппаМакросов.Значение 		= "";
	ГруппаМакросов.Представление 	= "Web-шаблоны заявок";
	ГруппаМакросов.ЭтоГруппа 		= Истина;
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаОбращения]", 		"Дата обращения", 		2); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Контрагент]", 			"Контрагент",			4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ТипПеревозки]", 		"Тип перевозки",		4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Содержание]", 			"Содержание",			4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[МенеджерПродаж]", 		"Менеджер продаж",		4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ОперативныйМенеджер]", "Оперативный менеджер",	4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Груз]", 				"Груз",					4);  			
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Типоразмер]", 			"Типоразмер",			4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[КоличествоПеревозок]", "Количество перевозок",	1); 
	
КонецПроцедуры  

Процедура ДобавитьСтрокуМакросов(ГруппаМакросов, Значение, Представление, ИндексКартинки)
	
	СтрокаМакроса = ГруппаМакросов.Строки.Добавить();
	СтрокаМакроса.ИндексКартинки 	= ИндексКартинки;
	СтрокаМакроса.Значение 			= Значение;
	СтрокаМакроса.Представление 	= Представление;
	СтрокаМакроса.ЭтоГруппа 		= Ложь;
	
КонецПроцедуры


Процедура ПолучитьОписаниеМакросов(Результат, СтруктураПараметров=Неопределено) Экспорт
	
	Результат.Вставить("[ДатаОбращения]", 		"Источник.ДатаОбращения");
	Результат.Вставить("[Контрагент]", 			"Источник.Контрагент");
	Результат.Вставить("[ТипПеревозки]", 		"Источник.ТипПеревозки");
	Результат.Вставить("[МенеджерПродаж]", 		"Источник.МенеджерПродаж");
	Результат.Вставить("[Груз]",				"Источник.Груз");
	Результат.Вставить("[Типоразмер]", 			"Источник.Типоразмер");
	Результат.Вставить("[КоличествоПеревозок]",	"Источник.КоличествоПеревозок");
	Результат.Вставить("[Содержание]",			"Источник.Содержание");
	
КонецПроцедуры
//---Шаблоны стандартных писем
